{
  "backend/main.mo": "Actor managing user profiles, reminder settings, and application logs with access control and CRUD-style query/update methods.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty reminder settings map.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend files to feature requirements and components.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base styles and warm-themed OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication flow, profile setup, and rendering the home experience.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper with header, reminder UI integration, footer, and user name display.",
  "frontend/src/components/ApplicationEntryForm.tsx": "Form for submitting new job application entries with company, role, notes, and success callback.",
  "frontend/src/components/FlameMomentumBadge.tsx": "Renders an animated flame icon that switches between flicker and burst styles based on a celebrate flag.",
  "frontend/src/components/InAppReminderBanner.tsx": "Displays a dismissible in-app reminder banner encouraging the user to log applications.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and automatic error handling.",
  "frontend/src/components/RecentEntriesList.tsx": "Fetches and displays a sortable list of recent job application entries with loading and empty states.",
  "frontend/src/components/ReminderSettingsDialog.tsx": "A dialog allowing users to enable and configure daily reminder times, with save and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for managing Internet Identity authentication, login flow, and persisted identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, application entries, and reminder settings using the backend actor.",
  "frontend/src/hooks/useReminderScheduler.ts": "Schedules daily reminders based on user settings and triggers in-app or browser notifications.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes and a warm color palette.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the App component.",
  "frontend/src/pages/HomeScreen.tsx": "Home screen showing application count, motivational UI, entry form, and recent entries list with celebration behavior.",
  "frontend/src/utils/motivation.ts": "Provides functions to generate motivational messages and compute next milestones based on application count.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, retrieving, and clearing URL and sessionStorage parameters with hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and content paths.",
  "project_state.json": "Project metadata tracking features, requirements, and current app state for the job-hunt tracker."
}