{
  "kind": "build_request",
  "title": "Add reminder scheduling and a motivational “keep the fire on” animation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a Reminder Settings UI that lets an authenticated user enable/disable reminders and configure a simple schedule (at minimum: frequency = daily, time of day). The UI must be accessible from the main authenticated experience (e.g., Home screen or App header) and use English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i also want to set reminder notifications"
        ]
      },
      "acceptanceCriteria": [
        "When signed in, the user can open a Reminder Settings UI and toggle reminders on/off.",
        "The user can select a time of day for the reminder and save it.",
        "All UI labels, helper text, and button text are in English.",
        "The settings UI works on mobile screen sizes without layout breakage."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Persist reminder settings per signed-in user in the Motoko backend and expose methods to read and update them. Access control must match existing profile/entry methods (only the caller can read/update their own settings unless admin).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i also want to set reminder notifications"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to fetch the caller’s reminder settings and an update method to save them.",
        "Unauthorized callers cannot read or update another user’s reminder settings.",
        "Reminder settings are stored per Principal similarly to existing userProfiles/appLogs patterns."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Implement reminder delivery in the frontend as an in-app reminder system with optional browser Notification API support when permissions are granted. The app must gracefully fall back to an in-app banner/dialog when notifications are not supported or permission is denied, and must not rely on push notifications.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "set reminder notifications"
        ]
      },
      "acceptanceCriteria": [
        "If reminders are enabled, the app schedules a reminder prompt based on the saved time-of-day while the app is open.",
        "If the user grants notification permission, the reminder can be shown via the browser Notification API while the app is open; otherwise, an in-app reminder UI is shown.",
        "If notification permission is denied or unsupported, the app does not error and still shows an in-app reminder UI.",
        "A clear control exists to disable reminders from the Reminder Settings UI."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a motivational “keep the fire on” animation to the Home screen that visually conveys ongoing momentum (e.g., a flame/flicker badge near the main count). The animation must be smooth, lightweight, and consistent with the existing warm theme (no blue/purple-dominant styling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "a good animation to keep the fire on"
        ]
      },
      "acceptanceCriteria": [
        "Home screen displays a flame/momentum visual element that animates (e.g., flicker/pulse) without impacting page usability.",
        "Animation remains performant on mobile (no excessive CPU usage, no layout thrash).",
        "The animation styling matches the existing warm palette defined in the app theme.",
        "The animated element does not block core actions (logging an application, viewing recent entries)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Trigger a short celebratory animation state when a new application entry is successfully logged (e.g., brief intensification of the flame/flicker or a subtle burst), using the existing ApplicationEntryForm onSuccess hook to coordinate UI feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "a good animation to keep the fire on"
        ]
      },
      "acceptanceCriteria": [
        "After successfully logging an application, the Home screen shows a brief, noticeable animation effect indicating progress.",
        "The effect does not trigger on validation failures or canceled submissions.",
        "The effect works even if the user logs multiple entries in a row (no stuck animation state)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Do not implement push notifications or any third-party notification service; reminders must work as in-app prompts with optional browser Notification API usage only while the app is open.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add migration.mo only if a state upgrade is required."
  ],
  "nonGoals": [
    "Implementing true background/scheduled push notifications when the browser/app is closed.",
    "Integrating external calendar services (Google Calendar, iCal) or SMS/email reminders.",
    "Adding third-party animation libraries or Lottie-based pipelines unless already present in the project."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}