{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reminder scheduling UI + in-app reminders + flame momentum animation",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add an authenticated Reminder Settings UI to enable/disable reminders and configure a daily time-of-day schedule.",
      "acceptanceCriteria": [
        "When signed in, the user can open a Reminder Settings UI and toggle reminders on/off.",
        "The user can select a time of day for the reminder and save it.",
        "All UI labels, helper text, and button text are in English.",
        "The settings UI works on mobile screen sizes without layout breakage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReminderSettingsDialog.tsx",
          "operation": "create",
          "description": "Create a Reminder Settings dialog UI (English text) with an enable/disable toggle and a time-of-day input (daily). Use shadcn-ui building blocks already used in the app (e.g., Dialog/Button/Input/Label) to match existing styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for reminder settings (fetch caller settings and save caller settings) using the existing actor pattern, including cache invalidation on save."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the Reminder Settings UI into the main authenticated experience by adding a header control (e.g., 'Reminders' button) that opens the ReminderSettingsDialog. Ensure header layout remains responsive on mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement in-app reminder delivery with optional browser Notification API support (no push), falling back gracefully to an in-app UI prompt.",
      "acceptanceCriteria": [
        "If reminders are enabled, the app schedules a reminder prompt based on the saved time-of-day while the app is open.",
        "If the user grants notification permission, the reminder can be shown via the browser Notification API while the app is open; otherwise, an in-app reminder UI is shown.",
        "If notification permission is denied or unsupported, the app does not error and still shows an in-app reminder UI.",
        "A clear control exists to disable reminders from the Reminder Settings UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useReminderScheduler.ts",
          "operation": "create",
          "description": "Create a hook that reads the saved reminder settings (via existing query hooks) and schedules the next reminder while the app is open using time-of-day logic; when it fires, attempt Notification API display if permitted, otherwise trigger an in-app reminder prompt state."
        },
        {
          "path": "frontend/src/components/InAppReminderBanner.tsx",
          "operation": "create",
          "description": "Create an in-app reminder prompt UI (banner/dialog) that can be shown when a reminder fires or when Notification API is unavailable/denied. Provide clear English copy and a dismiss action; ensure it is mobile-friendly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Mount the reminder scheduler hook during the authenticated experience and render the InAppReminderBanner when the scheduler requests it, ensuring graceful fallback behavior when Notification API is unsupported/denied."
        },
        {
          "path": "frontend/src/components/ReminderSettingsDialog.tsx",
          "operation": "modify",
          "description": "Add an explicit disable control that persists the disabled state (e.g., saving settings without a daily time) and ensure the scheduler stops when disabled. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a smooth, lightweight warm-themed 'keep the fire on' flame/flicker animation on the Home screen near the main count.",
      "acceptanceCriteria": [
        "Home screen displays a flame/momentum visual element that animates (e.g., flicker/pulse) without impacting page usability.",
        "Animation remains performant on mobile (no excessive CPU usage, no layout thrash).",
        "The animation styling matches the existing warm palette defined in the app theme.",
        "The animated element does not block core actions (logging an application, viewing recent entries)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FlameMomentumBadge.tsx",
          "operation": "create",
          "description": "Create a small flame/momentum visual component (CSS-only animation) designed to sit near the HomeScreen count; use warm theme tokens (primary/accent/destructive) and avoid blue/purple-dominant styling."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Add lightweight keyframes/animation utilities for flame flicker/pulse (transform/opacity-based) and an optional brief intensify state to support celebratory feedback."
        },
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Render the FlameMomentumBadge near the main applications count in the hero overlay, ensuring it does not block interactions and remains responsive on mobile."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Trigger a short celebratory animation state on the Home screen after a successful application log using ApplicationEntryForm onSuccess.",
      "acceptanceCriteria": [
        "After successfully logging an application, the Home screen shows a brief, noticeable animation effect indicating progress.",
        "The effect does not trigger on validation failures or canceled submissions.",
        "The effect works even if the user logs multiple entries in a row (no stuck animation state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Pass an onSuccess handler into ApplicationEntryForm to trigger a short-lived celebratory state; ensure rapid successive submissions restart the animation cleanly (no stuck state)."
        },
        {
          "path": "frontend/src/components/FlameMomentumBadge.tsx",
          "operation": "modify",
          "description": "Add a prop-driven 'celebrate' or 'burst' state that briefly intensifies the flame animation (using the Tailwind keyframes) and then returns to the steady flicker."
        }
      ]
    }
  ]
}